system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0.0  0   10)   //0
    (10   0   10)   //1
    (10   0   0)    //2
    (12   0   0)    //3 
    (12   0   10)   //4
    (12   0   14)   //5
    (10   0   14)   //6
    (0.0  0   14)   //7

    (0.0  1   10)   //8
    (10   1   10)   //9
    (10   1   0)    //10
    (12   1   0)    //11
    (12   1   10)   //12
    (12   1   14)   //13
    (10   1   14)   //14
    (0.0  1   14)   //15

);

blocks          
(
    hex (0 1 9 8 7 6 14 15) (100 1 40)   simpleGrading (1 1 1)  //block 0
    hex (1 4 12 9 6 5 13 14) (20 1 40)  simpleGrading (1 1 1)   //block 1
    hex (2 3 11 10 1 4 12 9) (20 1 100)  simpleGrading (1 1 1)   //block 2
);

edges           
(
);

boundary         
(
 
    atmosphere
    {
     type   patch;
     faces  (
             
             (15 7 6 14) 
             (14 6 5 13)
             );
    }

    wall 
    {
     type wall;
     faces (
           //floors
           (0 8 9 1)
           (2 10 11 3)

           //side walls
           (0 7 15 8)
           (2 1 9 10)
           (11 12 4 3)
           (12 13 5 4)          

           );

    }

);

mergePatchPairs
(
);

// ************************************************************************* //
