system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        set inletSet;
        name inlet;
		
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        patches ();
    }

    {
        set outletSet;
        name outlet;
		
        patchInfo
        {
            type patch;
        }
        constructFrom set;
        patches ();
    }

);

// ************************************************************************* //
