constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    atmosphere
    {
        type            patch;
        nFaces          120;
        startFace       13340;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          382;
        startFace       13460;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          13600;
        startFace       13842;
    }
    inlet
    {
        type            patch;
        nFaces          8;
        startFace       27442;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       27450;
    }
)

// ************************************************************************* //
