constant/turbulenceProperties.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
simulationType  RAS;

RAS
{
    RASModel mixtureKEpsilon; //continuousGasKEpsilon;

    turbulence      off;
    printCoeffs     off;

    // mixtureKEpsilonCoeffs
    // {
    //     Cp  1;
    //     C3  1;
    // }
}

/*simulationType  LES;

LES
{
    LESModel continuousGasKEqn; //Smagorinsky;

    turbulence      on;
    printCoeffs     on;

    delta           cubeRootVol;

    cubeRootVolCoeffs
    {
    }
}*/


// ************************************************************************* //
